[
  {
    "id": "22982d7d-0ca6-44a7-aeaa-5ee2ce4fd0e3",
    "title": "BBC set for major shake-up, claims newspaper",
    "url": "N/A",
    "text": "London - The British Broadcasting Corporation, the world #39;s biggest public broadcaster, is to cut almost a quarter of its 28 000-strong workforce, in the biggest shake-up in its 82-year history, The Times newspaper in London said on Monday."
  },
  {
    "id": "faf876bb-e7ca-45d9-81a4-f06b14ae77a2",
    "title": "Taking Microsoft for a spin?",
    "url": "N/A",
    "text": "The software juggernaut that conquered the desktop is racing to get Windows into your next car."
  },
  {
    "id": "4f2e7f28-0ea2-406c-afb8-99993f665488",
    "title": "September sales at Target stores beat retail average",
    "url": "N/A",
    "text": "MINNEAPOLIS - While other retailers struggled with a sluggish back-to-school season, Target Corp. reported same-store sales well above the industry average."
  },
  {
    "id": "211f65e9-1f69-43df-812f-3ed5644f76b5",
    "title": "Macromedia launches Flex Builder",
    "url": "N/A",
    "text": "Macromedia this week will ship Flex Builder, which is designed to provide an interactive development environment for the companys Flex presentation server."
  },
  {
    "id": "24b664ea-10d9-4287-a935-7cc640a90f06",
    "title": "Rocket lands near Afghan school as President Karzai due to visit (AFP)",
    "url": "N/A",
    "text": "AFP - A rocket landed near a school in southeast Afghanistan minutes before President Hamid Karzai was due to visit, forcing him to abandon his trip, presidential spokesman Jawad Ludin told AFP."
  },
  {
    "id": "81ff4656-3c56-4911-9c00-78e1e9b65d2f",
    "title": "Inter Milan seeks redemption win against Juventus",
    "url": "N/A",
    "text": "It is early in the season for a decisive match, yet Inter Milan-Juventus on Sunday is shaping up as exactly that. Serie A leader Juventus stands 15 points ahead of Inter, but both teams see the meeting as key to their season."
  },
  {
    "id": "f8fd737e-d5fe-4503-bb7e-af0cf980fa9b",
    "title": "Alitalia to cut 5,000 jobs in shake-up",
    "url": "N/A",
    "text": "Italy's flagship air carrier Alitalia plans to cut 5,000 jobs as part of restructuring efforts aimed at averting collapse, news reports and an industry source said yesterday."
  },
  {
    "id": "0abd3c80-871e-463f-8a8f-86158bf44e74",
    "title": "U.S. Men Qualify for Final in Shot Put",
    "url": "N/A",
    "text": "ANCIENT OLYMPIA, Greece - Two U.S. men advanced to the final of the shot put Wednesday, hoping to make even more history at the ancient site that gave birth to the Olympics 2,780 years ago..."
  },
  {
    "id": "aa84e532-3caf-4e70-b7f1-11e8a6e1405f",
    "title": "China to Let Individuals Trade in Gold",
    "url": "N/A",
    "text": "China #39;s gold-crazed masses will be allowed to trade in the precious metal under reforms that will upgrade trading on the country #39;s nascent market, state media reported Tuesday."
  },
  {
    "id": "fda2fea7-330a-4c32-a2b2-6475cd25d439",
    "title": "HP Revises Cluster Plans",
    "url": "N/A",
    "text": "HP (Quote, Chart) is dropping its efforts to port some Tru64 Unix products to HP-UX with the help of storage player Veritas . The two companies announced a multi-year agreement Thursday that finds HP #39;s sales "
  },
  {
    "id": "e48b0e0f-0ece-4d6b-94df-cf12478a737a",
    "title": "High Court Petitioned on Cable Net Access Rule",
    "url": "N/A",
    "text": "The Bush administration has asked the Supreme Court to overturn a decision that requires cable companies to open their high-speed Internet networks to rival online providers.\\&lt;FONT face=\"verdana,MS Sans Serif,arial,helvetica\" size=\"-2\"\\ color=\"#666666\"&gt;&lt;B&gt;-The Washington Post&lt;/B&gt;&lt;/FONT&gt;"
  },
  {
    "id": "20aac9bd-d612-4e88-92e2-5313ba251189",
    "title": "Oracle wins right to pursue rival (USATODAY.com)",
    "url": "N/A",
    "text": "USATODAY.com - A federal judge Thursday rejected the federal government's request to block Oracle's  (ORCL)  #36;7.7 billion hostile takeover bid for software rival PeopleSoft (PSFT), removing a major hurdle to one of the biggest mergers in Silicon Valley history."
  },
  {
    "id": "93284dd7-b0cd-4be6-a71a-594c10ce0c4d",
    "title": "Safeway Sets Outlook Below Estimates (Reuters)",
    "url": "N/A",
    "text": "Reuters - Grocery chain operator Safeway Inc.\\ on Wednesday set a 2005 earnings per share goal that\\was below analysts' expectations, with added marketing expenses\\and lingering impact from a strike at its Vons stores weighing\\on profits."
  },
  {
    "id": "c64ade0f-c4c3-4d9c-ab1c-24bc8712f857",
    "title": "Video games 'good for children'",
    "url": "N/A",
    "text": "Computer games can promote problem-solving and team-building in children, say games industry experts."
  },
  {
    "id": "25c7e553-17ca-435c-915c-9a09597a4d5b",
    "title": "8-Year-Old Basic Law May Be Outdated Already",
    "url": "N/A",
    "text": "Lawmakers are talking about rewriting the eight-year-old landmark law governing the nation's telephone, cable and media businesses."
  },
  {
    "id": "ffc863ad-1f18-4277-a355-7c0b1dd21623",
    "title": "China to deport Australian activist",
    "url": "N/A",
    "text": "China has deported an Australian activist and his American colleague after they campaigned for an improvement in human rights in Tibet by unfurling a banner in Beijing, it was reported today."
  },
  {
    "id": "8e5d12f3-4f73-4ba5-8290-1a70c402d2b2",
    "title": "O'Brien Sues OSU for  #36;3.4 Million (AP)",
    "url": "N/A",
    "text": "AP - Former Ohio State basketball coach Jim O'Brien sued the school, claiming he is owed at least  #36;3.4 million because his firing violated terms of his contract."
  },
  {
    "id": "1889334e-3665-4cc1-8e30-686242aaec66",
    "title": "Stocks Move Higher As Oil Prices Dip",
    "url": "N/A",
    "text": "NEW YORK - Stocks moved sharply higher Friday as oil prices dipped and a pair of upgrades in the semiconductor sector boosted technology shares.    Investors are closely watching oil prices, which topped \\$50 per barrel this week, hoping that consumer spending and sentiment, along with third-quarter earnings, would not be adversely affected by rising energy costs..."
  },
  {
    "id": "d0bce9a2-5245-4240-a058-57066880a91e",
    "title": "Both Candidates Use McCain in Campaign Ads (AP)",
    "url": "N/A",
    "text": "AP - Republican maverick John McCain campaigns with President Bush. He's good friends with Democrat John Kerry. And, in an unusual twist, he's shown up in campaign advertisements for both."
  },
  {
    "id": "6167b26c-f1c6-4261-a95e-5e5077b85905",
    "title": "Footprints on the Moon",
    "url": "N/A",
    "text": "The Moon offers a unique preserved laboratory free from the weathering that ages the record of how life arose on Earth. Studying radiation and polar craters may be targets for the next human or robotic missions."
  },
  {
    "id": "8ecdc645-7d8e-4522-bf73-3b56f9b1eaa1",
    "title": "MLB Notebook: Johnson trade still in the works",
    "url": "N/A",
    "text": "The New York Yankees, Arizona and Los Angeles spent yesterday trying to put the finishing touches on the megadeal that would move All-Stars Randy Johnson, Shawn Green and Javier Vazquez."
  },
  {
    "id": "949ae674-9813-4fe7-ac46-d72bfe4dc1d1",
    "title": "MSN #39;s download service expanding",
    "url": "N/A",
    "text": "Microsoft #39;s has launched its MSN music download service in eight more European countries as the software giant bids to takes on Apple #39;s market leading iTunes."
  },
  {
    "id": "5cfd2f9b-d3fe-4c83-8c46-4a2012ea485f",
    "title": "Phelps Wins Second Gold Medal",
    "url": "N/A",
    "text": "ATHENS, Greece - His quest to surpass Mark Spitz out of the way, Michael Phelps got back to winning gold. The 19-year-old from Baltimore claimed his second gold medal of the Athens Games in the 200-meter butterfly Tuesday night, though he was a bit disappointed at failing to break his own world record..."
  },
  {
    "id": "e76f3443-7d33-4a46-b386-10e891ee45e0",
    "title": "Geminid Meteor Shower Could Be Spectacular",
    "url": "N/A",
    "text": "DENVER -- Coloradans willing to brave the nighttime cold and get away from the lights of the city could be in for a spectacular show Monday night."
  },
  {
    "id": "c0b0b772-6cd3-4ed4-b15e-4cebaa77d654",
    "title": "Apple Jumps Ahead of HP iPod, iMac Launch (Reuters)",
    "url": "N/A",
    "text": "Reuters - Shares of Apple Computer Inc.\\(AAPL.O) rose to an almost four-year high on Thursday ahead of\\the launch of Hewlett-Packard Co.'s (HPQ.N) version of the iPod\\digital music player and Apple's revamped iMac computer."
  },
  {
    "id": "0a8ab75b-9143-4017-a7a7-7fbe9f17ff24",
    "title": "Henry on target for French",
    "url": "N/A",
    "text": "THIERRY HENRY finally added to his recent meagre goal tally for France in this World Cup qualifier today. Henry scored in the closing stages after Sylvain Wiltord #39;s opener, for only his third international "
  },
  {
    "id": "176360fe-ce1f-4096-91e8-17559374115f",
    "title": "Total Signs Draft Agreement for Novatek",
    "url": "N/A",
    "text": "Oil major Total SA has signed a draft agreement to purchase a 25 percent stake, plus one share, in the privately held Russian gas producer Novatek, the French company announced Wednesday."
  },
  {
    "id": "38d6e662-e271-4a70-beb2-b859b33bbad4",
    "title": "Apex court permits night viewing of Taj Mahal:",
    "url": "N/A",
    "text": "India News: New Delhi, Nov 25 : The Supreme Court Thursday permitted the Uttar Pradesh government to allow visitors to view the Taj Mahal on five moonlit nights a month."
  },
  {
    "id": "08c14d42-93a7-4c22-89c2-68d52129390d",
    "title": "Sprint, SBC Set Hot Spot Pact",
    "url": "N/A",
    "text": "Sprint (FON:NYSE - news - research) and SBC Communications (SBC:NYSE - news - research) set a plan that will give their customers access to both companies #39; Wi-Fi Internet service hot spots."
  },
  {
    "id": "24bc2fb2-0540-48ef-ba83-5339b4d9e75d",
    "title": "Space Station Crew Blast Off from Kazakh Steppe (Reuters)",
    "url": "N/A",
    "text": "Reuters - A Russian rocket carrying\\a U.S.-Russian space crew on a two-day flight to the\\International Space Station blasted off from the Baikonur\\cosmodrome in Kazakhstan early Thursday."
  },
  {
    "id": "d917dba1-b4b8-48ae-82f7-d285db66e618",
    "title": "Agassi, Nalbandian pull out",
    "url": "N/A",
    "text": "American Andre Agassi and Argentine David Nalbandian have pulled out of the Paris Masters, organizers said Monday, meaning neither will play in the season ending Masters Cup."
  },
  {
    "id": "ebc48f76-1d89-44aa-a46c-735368af1946",
    "title": "China rallies to v-ball win",
    "url": "N/A",
    "text": "Ping Zhang had 25 points yesterday as China came from two sets down to beat Russia for the gold medal in Olympic women #39;s volleyball."
  },
  {
    "id": "48e8308a-b189-4677-8b65-f1f8574e61cc",
    "title": "Barghouthi Pulls Out of Palestinian Election",
    "url": "N/A",
    "text": "Jailed Palestinian uprising leader Marwan Barghouthi has pulled out of a Jan. 9 presidential election to succeed Yasser Arafat, a close aide said on Sunday."
  },
  {
    "id": "82a895ee-62fb-4e64-a2a8-f81b450b6dbc",
    "title": "Kyle Busch takes Nextel Cup wheel",
    "url": "N/A",
    "text": "The 19-year-old Las Vegas native was announced Tuesday as the driver to replace two-time NASCAR Nextel Cup champion Terry Labonte behind the wheel of the No."
  },
  {
    "id": "808c62c5-adce-453c-a851-49813b0a6e43",
    "title": "Saudi to fight terrorists with prayers",
    "url": "N/A",
    "text": "Saudi Arabia said Friday it has advised the nation #39;s imams they should condemn terrorism and terrorists in prayers during the holy fasting month of Ramadan."
  },
  {
    "id": "3756df5a-01b0-44aa-b769-04f35708f084",
    "title": "UN Watchdog: No Sign of Iran Nuclear Activity at New Site",
    "url": "N/A",
    "text": "VIENNA, Sept 17 - The UN nuclear watchdog has found no signs of nuclear-related activity at a site in Iran called Parchin that several US officials have said may be linked to secret atom bomb research, Mohamed ElBaradei said on Friday."
  },
  {
    "id": "e51e2a97-950f-4596-91de-62e4df8b088c",
    "title": "Pesky's patience rewarded",
    "url": "N/A",
    "text": "Those were tears of joy he didn't even try to hide amid the wild celebration in the Red Sox' locker room last night. Sure, some champagne had been poured on him, but those were Johnny Pesky's emotions on display as he witnessed a scene that he never had a doubt he'd see."
  },
  {
    "id": "7e8ba7d4-4994-4d86-b87c-adc65bc1bd83",
    "title": "Meal tickets go as Silverstone is removed from the menu",
    "url": "N/A",
    "text": "The shockwaves generated by Bernie Ecclestone #39;s decision to scrap the British grand prix rippled out yesterday to touch every corner of the country #39;s motorsport industry, threatening Britain #39;s position as the global centre of international motor racing."
  },
  {
    "id": "00dbb70e-e76d-4d07-8332-e29ce521d075",
    "title": "UPDATE 3-Boston Scientific regains market share, stock up",
    "url": "N/A",
    "text": "Boston Scientific Corp. (BSX.N: Quote, Profile, Research) said on Wednesday it already recovered market share for its popular heart device after a recent recall "
  },
  {
    "id": "eb3558aa-ac8c-4511-901d-a976d4f414f6",
    "title": "Comparisons inevitable in draft-day rematch",
    "url": "N/A",
    "text": "It will be a Saturday afternoon soap opera, with the man the Giants vowed to have and to hold and the one they left at the altar crossing paths on the floor of Giants Stadium."
  },
  {
    "id": "fcbcda24-696c-4113-9327-d2a57d831183",
    "title": "Lions WR Roy Williams misses game in Dallas",
    "url": "N/A",
    "text": "Detroit Lions receiver Roy Williams missed Sunday #39;s game against the Dallas Cowboys because of an ankle injury. Williams leads the Lions with 24 catches for 362 yards and five touchdowns, having taken over "
  },
  {
    "id": "055f756a-390b-41fd-bcec-17fba73d8c62",
    "title": "New Florida Coach Meyer Names Coaches (AP)",
    "url": "N/A",
    "text": "AP - Florida coach Urban Meyer nearly filled out his coaching staff Monday, keeping two assistants from Ron Zook's staff and bringing four with him from Utah."
  },
  {
    "id": "26ba4f4a-55df-4890-984d-4a7e0c36a082",
    "title": "US Airways Reaches Deal on Aircraft Financing",
    "url": "N/A",
    "text": "US Airways Group Inc. said Friday it has reached agreement with General Electric Co. on aircraft leasing and financing terms that will help the airline lower costs and reduce debt as it seeks to avoid liquidation. The airline will also have to do more cost cutting on its own."
  },
  {
    "id": "06463d99-c5a4-4ebe-b649-543a78792b22",
    "title": "Gartner revises PC market forecast, warns of downside (MacCentral)",
    "url": "N/A",
    "text": "MacCentral - The PC market won't grow as fast in 2004 as originally predicted by Gartner Inc. analysts, as concerns about the overall health of the U.S. economy weigh on the market, the market research company said."
  },
  {
    "id": "595f7732-0b66-4019-bb72-8b14a1b715fb",
    "title": "Cheney: Kerry's View of Terrorism 'Naive' (AP)",
    "url": "N/A",
    "text": "AP - Vice President Dick Cheney, pursuing Republican votes in a reliably Democratic state, said Monday that Sen. John Kerry's view of terrorism reflects a naivete and an inability to recognize the seriousness of the threat."
  },
  {
    "id": "feb79c7d-dbc6-4472-9990-e5951ca9c6d0",
    "title": "Senator: Commander Told of Military Drain (AP)",
    "url": "N/A",
    "text": "AP - A former Senate Intelligence Committee chairman asserted Sunday that the general who ran the war in Afghanistan said more than a year before the U.S.-led invasion of Iraq that his resources were being shifted in preparation for taking on Saddam Hussein."
  },
  {
    "id": "7d445d05-6554-4df8-b19f-68789add8ed1",
    "title": "I Caught You Looking!",
    "url": "N/A",
    "text": "An innocent financial background check can send ripples through your credit file."
  },
  {
    "id": "2b00cd7b-91b5-4a01-bbb2-6c0e58a6e7e5",
    "title": "United Reach Rooney Agreement",
    "url": "N/A",
    "text": "Manchester United have announced they have reached an  quot;outline agreement quot; for the transfer of Wayne Rooney from Everton."
  },
  {
    "id": "68ebd933-f303-49f9-b678-7f6086ad255b",
    "title": "Hurricane Ivan Drenches Western Cuba",
    "url": "N/A",
    "text": "PINAR DEL RIO, Cuba - Hurricane Ivan slammed into Cuba's sparsely populated western tip with the worst of its 160-mph eyewall, growing to a storm of catastrophic strength after it smashed giant waves onto Grand Cayman island and readied to strike the Gulf of Mexico and U.S. oil interests..."
  },
  {
    "id": "5ccc593e-e8ae-4b0d-9426-59190a4bce17",
    "title": "Lufthansa reaches wages agreement",
    "url": "N/A",
    "text": "German airline Lufthansa reaches a deal with unions on pay and working hours for its ground staff."
  }
]